using System;
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public static class LevelGameOverMessages
{
    public static Dictionary<string, List<List<string>>> messages = new Dictionary<string, List<List<string>>>
    {
        {
            "Витоша", new List<List<string>>
            {
                new List<string> {"Знаеш ли, че древните имена на Витоша са били: Скопиос, Скомиос и Скромброс?"},
                new List<string> {"Знаеш ли, че най-дългата пещера в България се намира във Витоша – пещера „Духлата”"," наричат я още „Боснешката пещера“, е с дължина 17 600 метра." },
                new List<string> {"Знаеш ли, че Витоша е единствената кулообразна планина в страната ни."},
                new List<string> {"Знаеш ли, че само във Витоша има каменна река, наречена още \"Морените\". (И други планини притежават подобни, но като тези на Витоша няма другаде.)" },
                new List<string> {"Знаеш ли, че първата хижа във Витоша е х.Алеко (1924-1932г.)."},
                new List<string> {"Легендата разказва, че Витоша и Люлин планина са наречени на овчар и овчарка."}
            }
        },
        {
            "Рила", new List<List<string>>
            {
                new List<string> {"Знаеш ли, че"," древните имена на Витоша са били:", " Скопиос, Скомиос и Скромброс?"},
                new List<string> { "Знаеш ли, че най-дългата пещера в България се намира във Витоша – пещера „Духлата”, наричана още „Боснешката пещера“, е с дължина 17 600 метра." },
                new List<string> {"Знаеш ли, че Витоша е единствената кулообразна планина в страната ни."},
                new List<string> { "Знаеш ли, че само във Витоша има каменна река, наречена още \"Морените\". (И други планини притежават подобни, но като тези на Витоша няма другаде.)" },
                new List<string> {"Знаеш ли, че първата хижа във Витоша е х.Алеко (1924-1932г.)."},
                new List<string> {"Легендата разказва, че Витоша и Люлин планина са наречени на овчар и овчарка."}
            }
        }
    };
}
