using System;
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public static class LevelGameOverMessages
{
    public static Dictionary<string, List<List<string>>> messages = new Dictionary<string, List<List<string>>>
    {
        {
            "Витоша", new List<List<string>>
            {
                new List<string> {"Знаеш ли, че древните имена на Витоша са били: Скопиос, Скомиос и Скромброс?"},
                new List<string> {"Знаеш ли, че най-дългата пещера в България се намира във Витоша – пещера „Духлата”"," наричат я още „Боснешката пещера“, е с дължина 17 600 метра." },
                new List<string> {"Знаеш ли, че Витоша е единствената кулообразна планина в страната ни."},
                new List<string> {"Знаеш ли, че само във Витоша има каменна река, наречена още \"Морените\"."," (И други планини притежават подобни, но като тези на Витоша няма другаде.)" },
                new List<string> {"Знаеш ли, че първата хижа във Витоша е х.Алеко (1924-1932г.).",""},
                new List<string> {"Легендата разказва, че Витоша и Люлин планина са наречени на овчар и овчарка,","" +
                    " които силно се обичали. Вита пеела от върха на „Голямото било”,","" +
                    " а Люлин и пригласял с гъдулката си от „Дългото било”. Двамата никога","" +
                    " не се били срещали, но искали да бъдат заедно. Когато Вита станала мома ","" +
                    "за женене, момци от близки и далечни села идвали да поискат ръката й, но ","" +
                    "тя все отказвала, защото копнеела да се омъжи за Люлин. Ядосаната майка на"," " +
                    "Вита не могла да понесе поредния отказ за брак и проклела дъщеря си и нейния","" +
                    " възлюбен. Клетвата застигнала младите и те се вкаменили на местата си.","" +
                    " Двете била носят имената им, а върхът, на който Вита се превърнала в черен камък, наричаме Черни връх.",""}
            }
        },
        {
            "Рила", new List<List<string>>
            {
                new List<string> {"Знаеш ли, че първото име на Рила е било “Доункас”, което означава “Планина с много вода”."},
                new List<string> { "Знаеш ли, че Седемте Рилски езера са с ледников произход и всяко едно има собствено име: ","" +
                    "Сълзата, Окото, Бъбрека, Близнака, Трилистника, Рибното и Долното." },
                new List<string> {"Знаеш ли, че Леденото езеро в Рила е най-високото на Балканите."},
                new List<string> { "Знаеш ли, че метеорологичната станция на връх Мусала е най-високата в Европа." },
                new List<string> {"Знаеш ли, че най-високата точка в Рила и на Балканският полуостров е връх Мусала (2925,4 м.)."},
                new List<string> { "Знаеш ли, че според легендата Рилка имала две ","" +
                    "буйни деца - Искър и Места. Един ден децата се скарали жестоко"," " +
                    "и майката през сълзи пожелала децата и да се разделят и повече никога","" +
                    " да не се срещат, за да не се карат. В този миг Рилка се превърнала","" +
                    " в планина, а децата и в реки и никога не се срещнали." }
            }
        },
         {
            "Родопите", new List<List<string>>
            {
                new List<string> {"Знаеш ли, че преди стотици хиляди години е имало пещера, която под въздействието ","" +
                    "на водите на река Еркюприя, се свличала и така се образувал","" +
                    " великолепният скален феномен “Чудните мостове”."},
                new List<string> { "Знаеш ли, че пещерата “Снежанка”, наречена още","" +
                    " “Перлата на Родопите” е събрала всички форми на пещерни"," " +
                    "образувания. Също така е пълна със снежнобели наслаги, ","" +
                    "образували се милиони години и застанали в причудливи ","" +
                    "форми - делфин, папагал, джудже, девойка и други..." },
                new List<string> {"Знаеш ли, че Ягодинската пещера е била обитавана от енеолита(каменно-медната епоха)."},
                new List<string> { "Знаеш ли, че в Дяволското гърло се намира най-високият подземен водопад на Балканите(42м.)." },
                new List<string> {"Знаеш ли, че Голям Перелик е най-високият връх в Родопите."},
                new List<string> { "Знаеш ли, че според легендата митичната тракийска ","" +
                    "царица Родопа и нейният брат Хемус (Стара планина) били ","" +
                    "влюбени един в друг. Толкова били изпълнени с гордост,"," " +
                    "че се били превъзгласили за боговете Зевс и Хера. ","" +
                    "Богът Овидий се ядосал и за наказание ги превърнал в"," " +
                    "планини, разделени от обширна низина." }
            }
        },
         {
            "Пирин", new List<List<string>>
            {
                new List<string> {"Знаеш ли, че тракийското име на Пирин е “Орбелус”, което означава “белоснежна планина”."},
                new List<string> { "Знаеш ли, че в Пирин се намира едно от най-старите дървета в света - Байкушевата мура (1300г.)." },
                new List<string> {"Знаеш ли, че в сърцето си Пирин е направена от гранит - има 62% гранитно ядро."},
                new List<string> { "Знаеш ли, че в Пирин се намира пътека, толкова остра,","" +
                    " че туристите преди години (вече са сложени въжета за придържане)","" +
                    " са възсядали на пътеката и са минавали през нея чрез пълзене.","" +
                    " Оттам идва името и - Кончето." },
                new List<string> {"Знаеш ли, че най-високият връх в Пирин се нарича Вихрен(2914,3м)"},
                new List<string> { "Знаеш ли, че от всички планини в България, само ","" +
                    "в Пирин може да се намери застрашеният вид цвете “Еделвайс”" }
            }
        }
    };
}
